{
  "<pad>": 0,
  "<sos>": 1,
  "<eos>": 2,
  "<unk>": 3,
  "\n": 4,
  "(": 5,
  ")": 6,
  ".": 7,
  "0": 8,
  "1": 9,
  "5": 10,
  "?": 11,
  "B": 12,
  "D": 13,
  "E": 14,
  "I": 15,
  "N": 16,
  "U": 17,
  "Z": 18,
  "a": 19,
  "b": 20,
  "n": 21,
  "o": 22,
  "₂": 23,
  "": 24,
  "𒀀": 25,
  "𒀁": 26,
  "𒀉": 27,
  "𒀊": 28,
  "𒀏": 29,
  "𒀕": 30,
  "𒀖": 31,
  "𒀘": 32,
  "𒀚": 33,
  "𒀜": 34,
  "𒀝": 35,
  "𒀞": 36,
  "𒀠": 37,
  "𒀩": 38,
  "𒀪": 39,
  "𒀫": 40,
  "𒀬": 41,
  "𒀭": 42,
  "𒀮": 43,
  "𒀯": 44,
  "𒀲": 45,
  "𒀳": 46,
  "𒀴": 47,
  "𒀸": 48,
  "𒀹": 49,
  "𒀾": 50,
  "𒀿": 51,
  "𒁀": 52,
  "𒁁": 53,
  "𒁃": 54,
  "𒁄": 55,
  "𒁆": 56,
  "𒁇": 57,
  "𒁈": 58,
  "𒁉": 59,
  "𒁍": 60,
  "𒁑": 61,
  "𒁓": 62,
  "𒁔": 63,
  "𒁕": 64,
  "𒁖": 65,
  "𒁜": 66,
  "𒁦": 67,
  "𒁮": 68,
  "𒁯": 69,
  "𒁰": 70,
  "𒁲": 71,
  "𒁳": 72,
  "𒁴": 73,
  "𒁵": 74,
  "𒁶": 75,
  "𒁷": 76,
  "𒁹": 77,
  "𒁺": 78,
  "𒁻": 79,
  "𒁼": 80,
  "𒁽": 81,
  "𒁾": 82,
  "𒂀": 83,
  "𒂁": 84,
  "𒂂": 85,
  "𒂃": 86,
  "𒂄": 87,
  "𒂅": 88,
  "𒂆": 89,
  "𒂇": 90,
  "𒂈": 91,
  "𒂉": 92,
  "𒂊": 93,
  "𒂍": 94,
  "𒂔": 95,
  "𒂕": 96,
  "𒂖": 97,
  "𒂗": 98,
  "𒂙": 99,
  "𒂞": 100,
  "𒂟": 101,
  "𒂠": 102,
  "𒂡": 103,
  "𒂦": 104,
  "𒂵": 105,
  "𒂷": 106,
  "𒂼": 107,
  "𒃌": 108,
  "𒃞": 109,
  "𒃡": 110,
  "𒃢": 111,
  "𒃣": 112,
  "𒃮": 113,
  "𒃰": 114,
  "𒃲": 115,
  "𒃴": 116,
  "𒃵": 117,
  "𒃶": 118,
  "𒃷": 119,
  "𒃸": 120,
  "𒃻": 121,
  "𒃼": 122,
  "𒃽": 123,
  "𒃾": 124,
  "𒄀": 125,
  "𒄃": 126,
  "𒄄": 127,
  "𒄇": 128,
  "𒄈": 129,
  "𒄉": 130,
  "𒄊": 131,
  "𒄋": 132,
  "𒄑": 133,
  "𒄒": 134,
  "𒄖": 135,
  "𒄗": 136,
  "𒄘": 137,
  "𒄙": 138,
  "𒄛": 139,
  "𒄝": 140,
  "𒄞": 141,
  "𒄠": 142,
  "𒄢": 143,
  "𒄣": 144,
  "𒄤": 145,
  "𒄥": 146,
  "𒄧": 147,
  "𒄨": 148,
  "𒄩": 149,
  "𒄫": 150,
  "𒄬": 151,
  "𒄭": 152,
  "𒄯": 153,
  "𒄰": 154,
  "𒄲": 155,
  "𒄴": 156,
  "𒄵": 157,
  "𒄷": 158,
  "𒄸": 159,
  "𒄽": 160,
  "𒄾": 161,
  "𒄿": 162,
  "𒅀": 163,
  "𒅁": 164,
  "𒅂": 165,
  "𒅅": 166,
  "𒅆": 167,
  "𒅇": 168,
  "𒅈": 169,
  "𒅊": 170,
  "𒅋": 171,
  "𒅍": 172,
  "𒅎": 173,
  "𒅓": 174,
  "𒅔": 175,
  "𒅕": 176,
  "𒅖": 177,
  "𒅗": 178,
  "𒅘": 179,
  "𒅜": 180,
  "𒅢": 181,
  "𒅤": 182,
  "𒅥": 183,
  "𒅪": 184,
  "𒅲": 185,
  "𒅴": 186,
  "𒅸": 187,
  "𒅻": 188,
  "𒅾": 189,
  "𒆃": 190,
  "𒆍": 191,
  "𒆏": 192,
  "𒆐": 193,
  "𒆑": 194,
  "𒆒": 195,
  "𒆓": 196,
  "𒆕": 197,
  "𒆗": 198,
  "𒆘": 199,
  "𒆚": 200,
  "𒆛": 201,
  "𒆜": 202,
  "𒆟": 203,
  "𒆠": 204,
  "𒆢": 205,
  "𒆤": 206,
  "𒆥": 207,
  "𒆦": 208,
  "𒆧": 209,
  "𒆪": 210,
  "𒆬": 211,
  "𒆭": 212,
  "𒆯": 213,
  "𒆰": 214,
  "𒆲": 215,
  "𒆳": 216,
  "𒆷": 217,
  "𒆸": 218,
  "𒆹": 219,
  "𒇀": 220,
  "𒇇": 221,
  "𒇉": 222,
  "𒇒": 223,
  "𒇡": 224,
  "𒇥": 225,
  "𒇧": 226,
  "𒇬": 227,
  "𒇭": 228,
  "𒇯": 229,
  "𒇲": 230,
  "𒇳": 231,
  "𒇴": 232,
  "𒇵": 233,
  "𒇷": 234,
  "𒇸": 235,
  "𒇹": 236,
  "𒇺": 237,
  "𒇻": 238,
  "𒇽": 239,
  "𒇿": 240,
  "𒈕": 241,
  "𒈖": 242,
  "𒈗": 243,
  "𒈛": 244,
  "𒈜": 245,
  "𒈝": 246,
  "𒈠": 247,
  "𒈢": 248,
  "𒈣": 249,
  "𒈤": 250,
  "𒈥": 251,
  "𒈦": 252,
  "𒈧": 253,
  "𒈨": 254,
  "𒈩": 255,
  "𒈪": 256,
  "𒈫": 257,
  "𒈬": 258,
  "𒈭": 259,
  "𒈮": 260,
  "𒈯": 261,
  "𒈲": 262,
  "𒈹": 263,
  "𒈻": 264,
  "𒈽": 265,
  "𒈾": 266,
  "𒈿": 267,
  "𒉀": 268,
  "𒉄": 269,
  "𒉅": 270,
  "𒉆": 271,
  "𒉇": 272,
  "𒉈": 273,
  "𒉋": 274,
  "𒉌": 275,
  "𒉎": 276,
  "𒉏": 277,
  "𒉐": 278,
  "𒉒": 279,
  "𒉓": 280,
  "𒉘": 281,
  "𒉚": 282,
  "𒉠": 283,
  "𒉡": 284,
  "𒉢": 285,
  "𒉣": 286,
  "𒉪": 287,
  "𒉭": 288,
  "𒉺": 289,
  "𒉻": 290,
  "𒉼": 291,
  "𒉽": 292,
  "𒉾": 293,
  "𒉿": 294,
  "𒊊": 295,
  "𒊌": 296,
  "𒊍": 297,
  "𒊏": 298,
  "𒊐": 299,
  "𒊑": 300,
  "𒊒": 301,
  "𒊓": 302,
  "𒊕": 303,
  "𒊚": 304,
  "𒊨": 305,
  "𒊩": 306,
  "𒊬": 307,
  "𒊭": 308,
  "𒊮": 309,
  "𒊯": 310,
  "𒊷": 311,
  "𒊹": 312,
  "𒊺": 313,
  "𒊻": 314,
  "𒊿": 315,
  "𒋀": 316,
  "𒋁": 317,
  "𒋃": 318,
  "𒋆": 319,
  "𒋇": 320,
  "𒋋": 321,
  "𒋒": 322,
  "𒋓": 323,
  "𒋗": 324,
  "𒋙": 325,
  "𒋚": 326,
  "𒋛": 327,
  "𒋜": 328,
  "𒋝": 329,
  "𒋞": 330,
  "𒋠": 331,
  "𒋡": 332,
  "𒋢": 333,
  "𒋤": 334,
  "𒋥": 335,
  "𒋦": 336,
  "𒋧": 337,
  "𒋩": 338,
  "𒋫": 339,
  "𒋬": 340,
  "𒋭": 341,
  "𒋰": 342,
  "𒋳": 343,
  "𒋺": 344,
  "𒋻": 345,
  "𒋼": 346,
  "𒋽": 347,
  "𒋾": 348,
  "𒌀": 349,
  "𒌁": 350,
  "𒌅": 351,
  "𒌆": 352,
  "𒌇": 353,
  "𒌈": 354,
  "𒌉": 355,
  "𒌋": 356,
  "𒌌": 357,
  "𒌍": 358,
  "𒌑": 359,
  "𒌒": 360,
  "𒌓": 361,
  "𒌔": 362,
  "𒌗": 363,
  "𒌜": 364,
  "𒌝": 365,
  "𒌢": 366,
  "𒌣": 367,
  "𒌤": 368,
  "𒌦": 369,
  "𒌨": 370,
  "𒌫": 371,
  "𒌴": 372,
  "𒌵": 373,
  "𒌶": 374,
  "𒌷": 375,
  "𒌺": 376,
  "𒍀": 377,
  "𒍂": 378,
  "𒍇": 379,
  "𒍍": 380,
  "𒍎": 381,
  "𒍏": 382,
  "𒍑": 383,
  "𒍒": 384,
  "𒍗": 385,
  "𒍚": 386,
  "𒍜": 387,
  "𒍝": 388,
  "𒍞": 389,
  "𒍠": 390,
  "𒍢": 391,
  "𒍣": 392,
  "𒍤": 393,
  "𒍥": 394,
  "𒍦": 395,
  "𒍨": 396,
  "𒍩": 397,
  "𒍪": 398,
  "𒍬": 399,
  "𒍮": 400,
  "𒐈": 401,
  "𒐉": 402,
  "𒐊": 403,
  "𒐋": 404,
  "𒐌": 405,
  "𒐍": 406,
  "𒐏": 407,
  "𒐐": 408,
  "𒐕": 409,
  "𒐖": 410,
  "𒐗": 411,
  "𒐘": 412,
  "𒐙": 413,
  "𒐜": 414,
  "𒐞": 415,
  "𒑆": 416,
  "𒑏": 417,
  "𒑐": 418,
  "𒑑": 419,
  "𒑒": 420,
  "𒑔": 421,
  "𒑖": 422,
  "𒑚": 423,
  "𒑛": 424,
  "𒑱": 425,
  "𒑳": 426
}