{
  "<pad>": 0,
  "<sos>": 1,
  "<eos>": 2,
  "<unk>": 3,
  "\n": 4,
  ".": 5,
  "0": 6,
  "o": 7,
  "": 8,
  "𒀀": 9,
  "𒀉": 10,
  "𒀊": 11,
  "𒀏": 12,
  "𒀕": 13,
  "𒀖": 14,
  "𒀘": 15,
  "𒀚": 16,
  "𒀜": 17,
  "𒀝": 18,
  "𒀞": 19,
  "𒀠": 20,
  "𒀩": 21,
  "𒀪": 22,
  "𒀫": 23,
  "𒀬": 24,
  "𒀭": 25,
  "𒀮": 26,
  "𒀯": 27,
  "𒀲": 28,
  "𒀳": 29,
  "𒀴": 30,
  "𒀸": 31,
  "𒀹": 32,
  "𒀾": 33,
  "𒁀": 34,
  "𒁁": 35,
  "𒁄": 36,
  "𒁇": 37,
  "𒁈": 38,
  "𒁉": 39,
  "𒁍": 40,
  "𒁓": 41,
  "𒁔": 42,
  "𒁕": 43,
  "𒁖": 44,
  "𒁜": 45,
  "𒁮": 46,
  "𒁯": 47,
  "𒁲": 48,
  "𒁳": 49,
  "𒁴": 50,
  "𒁵": 51,
  "𒁶": 52,
  "𒁷": 53,
  "𒁹": 54,
  "𒁺": 55,
  "𒁼": 56,
  "𒁾": 57,
  "𒂁": 58,
  "𒂂": 59,
  "𒂃": 60,
  "𒂄": 61,
  "𒂅": 62,
  "𒂆": 63,
  "𒂇": 64,
  "𒂉": 65,
  "𒂊": 66,
  "𒂍": 67,
  "𒂔": 68,
  "𒂕": 69,
  "𒂖": 70,
  "𒂗": 71,
  "𒂙": 72,
  "𒂞": 73,
  "𒂟": 74,
  "𒂠": 75,
  "𒂡": 76,
  "𒂦": 77,
  "𒂵": 78,
  "𒂷": 79,
  "𒂼": 80,
  "𒃌": 81,
  "𒃞": 82,
  "𒃡": 83,
  "𒃣": 84,
  "𒃮": 85,
  "𒃰": 86,
  "𒃲": 87,
  "𒃵": 88,
  "𒃶": 89,
  "𒃷": 90,
  "𒃻": 91,
  "𒃼": 92,
  "𒃽": 93,
  "𒃾": 94,
  "𒄀": 95,
  "𒄃": 96,
  "𒄄": 97,
  "𒄇": 98,
  "𒄈": 99,
  "𒄉": 100,
  "𒄊": 101,
  "𒄑": 102,
  "𒄒": 103,
  "𒄖": 104,
  "𒄗": 105,
  "𒄘": 106,
  "𒄙": 107,
  "𒄞": 108,
  "𒄠": 109,
  "𒄢": 110,
  "𒄣": 111,
  "𒄤": 112,
  "𒄥": 113,
  "𒄧": 114,
  "𒄨": 115,
  "𒄩": 116,
  "𒄫": 117,
  "𒄬": 118,
  "𒄭": 119,
  "𒄯": 120,
  "𒄰": 121,
  "𒄴": 122,
  "𒄵": 123,
  "𒄷": 124,
  "𒄸": 125,
  "𒄾": 126,
  "𒄿": 127,
  "𒅀": 128,
  "𒅁": 129,
  "𒅂": 130,
  "𒅅": 131,
  "𒅆": 132,
  "𒅇": 133,
  "𒅈": 134,
  "𒅋": 135,
  "𒅍": 136,
  "𒅎": 137,
  "𒅔": 138,
  "𒅕": 139,
  "𒅖": 140,
  "𒅗": 141,
  "𒅘": 142,
  "𒅤": 143,
  "𒅥": 144,
  "𒅴": 145,
  "𒅸": 146,
  "𒅾": 147,
  "𒆃": 148,
  "𒆍": 149,
  "𒆏": 150,
  "𒆑": 151,
  "𒆕": 152,
  "𒆗": 153,
  "𒆘": 154,
  "𒆚": 155,
  "𒆜": 156,
  "𒆟": 157,
  "𒆠": 158,
  "𒆤": 159,
  "𒆥": 160,
  "𒆦": 161,
  "𒆧": 162,
  "𒆪": 163,
  "𒆬": 164,
  "𒆭": 165,
  "𒆰": 166,
  "𒆲": 167,
  "𒆳": 168,
  "𒆷": 169,
  "𒆸": 170,
  "𒆹": 171,
  "𒇀": 172,
  "𒇇": 173,
  "𒇉": 174,
  "𒇡": 175,
  "𒇥": 176,
  "𒇧": 177,
  "𒇬": 178,
  "𒇭": 179,
  "𒇯": 180,
  "𒇲": 181,
  "𒇳": 182,
  "𒇴": 183,
  "𒇷": 184,
  "𒇸": 185,
  "𒇹": 186,
  "𒇺": 187,
  "𒇻": 188,
  "𒇽": 189,
  "𒈗": 190,
  "𒈛": 191,
  "𒈜": 192,
  "𒈝": 193,
  "𒈠": 194,
  "𒈢": 195,
  "𒈣": 196,
  "𒈤": 197,
  "𒈥": 198,
  "𒈦": 199,
  "𒈧": 200,
  "𒈨": 201,
  "𒈩": 202,
  "𒈪": 203,
  "𒈫": 204,
  "𒈬": 205,
  "𒈭": 206,
  "𒈮": 207,
  "𒈲": 208,
  "𒈹": 209,
  "𒈽": 210,
  "𒈾": 211,
  "𒈿": 212,
  "𒉀": 213,
  "𒉄": 214,
  "𒉅": 215,
  "𒉆": 216,
  "𒉈": 217,
  "𒉋": 218,
  "𒉌": 219,
  "𒉏": 220,
  "𒉐": 221,
  "𒉓": 222,
  "𒉘": 223,
  "𒉚": 224,
  "𒉠": 225,
  "𒉡": 226,
  "𒉢": 227,
  "𒉣": 228,
  "𒉪": 229,
  "𒉭": 230,
  "𒉺": 231,
  "𒉻": 232,
  "𒉼": 233,
  "𒉽": 234,
  "𒉿": 235,
  "𒊌": 236,
  "𒊍": 237,
  "𒊏": 238,
  "𒊐": 239,
  "𒊑": 240,
  "𒊒": 241,
  "𒊓": 242,
  "𒊕": 243,
  "𒊨": 244,
  "𒊩": 245,
  "𒊬": 246,
  "𒊭": 247,
  "𒊮": 248,
  "𒊯": 249,
  "𒊷": 250,
  "𒊹": 251,
  "𒊺": 252,
  "𒊻": 253,
  "𒊿": 254,
  "𒋀": 255,
  "𒋁": 256,
  "𒋃": 257,
  "𒋆": 258,
  "𒋓": 259,
  "𒋗": 260,
  "𒋙": 261,
  "𒋚": 262,
  "𒋛": 263,
  "𒋜": 264,
  "𒋝": 265,
  "𒋞": 266,
  "𒋠": 267,
  "𒋡": 268,
  "𒋢": 269,
  "𒋤": 270,
  "𒋥": 271,
  "𒋦": 272,
  "𒋧": 273,
  "𒋩": 274,
  "𒋫": 275,
  "𒋬": 276,
  "𒋭": 277,
  "𒋰": 278,
  "𒋳": 279,
  "𒋺": 280,
  "𒋻": 281,
  "𒋼": 282,
  "𒋾": 283,
  "𒌀": 284,
  "𒌁": 285,
  "𒌅": 286,
  "𒌆": 287,
  "𒌇": 288,
  "𒌈": 289,
  "𒌉": 290,
  "𒌋": 291,
  "𒌌": 292,
  "𒌍": 293,
  "𒌑": 294,
  "𒌒": 295,
  "𒌓": 296,
  "𒌗": 297,
  "𒌜": 298,
  "𒌝": 299,
  "𒌢": 300,
  "𒌣": 301,
  "𒌤": 302,
  "𒌦": 303,
  "𒌨": 304,
  "𒌫": 305,
  "𒌵": 306,
  "𒌶": 307,
  "𒌷": 308,
  "𒌺": 309,
  "𒍂": 310,
  "𒍇": 311,
  "𒍎": 312,
  "𒍏": 313,
  "𒍑": 314,
  "𒍗": 315,
  "𒍜": 316,
  "𒍝": 317,
  "𒍠": 318,
  "𒍢": 319,
  "𒍣": 320,
  "𒍤": 321,
  "𒍥": 322,
  "𒍦": 323,
  "𒍨": 324,
  "𒍩": 325,
  "𒍪": 326,
  "𒍮": 327,
  "𒐈": 328,
  "𒐉": 329,
  "𒐊": 330,
  "𒐋": 331,
  "𒐌": 332,
  "𒐍": 333,
  "𒐏": 334,
  "𒐐": 335,
  "𒐕": 336,
  "𒐖": 337,
  "𒐗": 338,
  "𒐞": 339,
  "𒑆": 340,
  "𒑏": 341,
  "𒑐": 342,
  "𒑑": 343,
  "𒑔": 344,
  "𒑖": 345,
  "𒑱": 346,
  "𒑳": 347
}