{
  "<pad>": 0,
  "<sos>": 1,
  "<eos>": 2,
  "<unk>": 3,
  "\n": 4,
  "(": 5,
  ")": 6,
  ".": 7,
  "0": 8,
  "1": 9,
  "5": 10,
  "?": 11,
  "B": 12,
  "D": 13,
  "E": 14,
  "I": 15,
  "N": 16,
  "U": 17,
  "Z": 18,
  "a": 19,
  "b": 20,
  "n": 21,
  "o": 22,
  "₂": 23,
  "": 24,
  "𒀀": 25,
  "𒀉": 26,
  "𒀊": 27,
  "𒀏": 28,
  "𒀕": 29,
  "𒀖": 30,
  "𒀘": 31,
  "𒀚": 32,
  "𒀜": 33,
  "𒀝": 34,
  "𒀞": 35,
  "𒀠": 36,
  "𒀩": 37,
  "𒀪": 38,
  "𒀫": 39,
  "𒀬": 40,
  "𒀭": 41,
  "𒀮": 42,
  "𒀯": 43,
  "𒀲": 44,
  "𒀳": 45,
  "𒀴": 46,
  "𒀸": 47,
  "𒀹": 48,
  "𒀾": 49,
  "𒀿": 50,
  "𒁀": 51,
  "𒁁": 52,
  "𒁃": 53,
  "𒁄": 54,
  "𒁇": 55,
  "𒁈": 56,
  "𒁉": 57,
  "𒁍": 58,
  "𒁑": 59,
  "𒁓": 60,
  "𒁔": 61,
  "𒁕": 62,
  "𒁖": 63,
  "𒁜": 64,
  "𒁦": 65,
  "𒁮": 66,
  "𒁯": 67,
  "𒁰": 68,
  "𒁲": 69,
  "𒁳": 70,
  "𒁴": 71,
  "𒁵": 72,
  "𒁶": 73,
  "𒁷": 74,
  "𒁹": 75,
  "𒁺": 76,
  "𒁻": 77,
  "𒁼": 78,
  "𒁽": 79,
  "𒁾": 80,
  "𒂀": 81,
  "𒂁": 82,
  "𒂂": 83,
  "𒂃": 84,
  "𒂄": 85,
  "𒂅": 86,
  "𒂆": 87,
  "𒂇": 88,
  "𒂈": 89,
  "𒂉": 90,
  "𒂊": 91,
  "𒂍": 92,
  "𒂔": 93,
  "𒂕": 94,
  "𒂖": 95,
  "𒂗": 96,
  "𒂙": 97,
  "𒂞": 98,
  "𒂟": 99,
  "𒂠": 100,
  "𒂡": 101,
  "𒂦": 102,
  "𒂵": 103,
  "𒂷": 104,
  "𒂼": 105,
  "𒃌": 106,
  "𒃞": 107,
  "𒃡": 108,
  "𒃢": 109,
  "𒃣": 110,
  "𒃮": 111,
  "𒃰": 112,
  "𒃲": 113,
  "𒃴": 114,
  "𒃵": 115,
  "𒃶": 116,
  "𒃷": 117,
  "𒃸": 118,
  "𒃻": 119,
  "𒃼": 120,
  "𒃽": 121,
  "𒃾": 122,
  "𒄀": 123,
  "𒄃": 124,
  "𒄄": 125,
  "𒄇": 126,
  "𒄈": 127,
  "𒄉": 128,
  "𒄊": 129,
  "𒄋": 130,
  "𒄑": 131,
  "𒄒": 132,
  "𒄖": 133,
  "𒄗": 134,
  "𒄘": 135,
  "𒄙": 136,
  "𒄛": 137,
  "𒄝": 138,
  "𒄞": 139,
  "𒄠": 140,
  "𒄢": 141,
  "𒄣": 142,
  "𒄤": 143,
  "𒄥": 144,
  "𒄧": 145,
  "𒄨": 146,
  "𒄩": 147,
  "𒄫": 148,
  "𒄬": 149,
  "𒄭": 150,
  "𒄯": 151,
  "𒄰": 152,
  "𒄴": 153,
  "𒄵": 154,
  "𒄷": 155,
  "𒄸": 156,
  "𒄽": 157,
  "𒄾": 158,
  "𒄿": 159,
  "𒅀": 160,
  "𒅁": 161,
  "𒅂": 162,
  "𒅅": 163,
  "𒅆": 164,
  "𒅇": 165,
  "𒅈": 166,
  "𒅊": 167,
  "𒅋": 168,
  "𒅍": 169,
  "𒅎": 170,
  "𒅓": 171,
  "𒅔": 172,
  "𒅕": 173,
  "𒅖": 174,
  "𒅗": 175,
  "𒅘": 176,
  "𒅜": 177,
  "𒅤": 178,
  "𒅥": 179,
  "𒅪": 180,
  "𒅲": 181,
  "𒅴": 182,
  "𒅸": 183,
  "𒅻": 184,
  "𒅾": 185,
  "𒆃": 186,
  "𒆍": 187,
  "𒆏": 188,
  "𒆐": 189,
  "𒆑": 190,
  "𒆒": 191,
  "𒆓": 192,
  "𒆕": 193,
  "𒆗": 194,
  "𒆘": 195,
  "𒆚": 196,
  "𒆛": 197,
  "𒆜": 198,
  "𒆟": 199,
  "𒆠": 200,
  "𒆢": 201,
  "𒆤": 202,
  "𒆥": 203,
  "𒆦": 204,
  "𒆧": 205,
  "𒆪": 206,
  "𒆬": 207,
  "𒆭": 208,
  "𒆯": 209,
  "𒆰": 210,
  "𒆲": 211,
  "𒆳": 212,
  "𒆷": 213,
  "𒆸": 214,
  "𒆹": 215,
  "𒇀": 216,
  "𒇇": 217,
  "𒇉": 218,
  "𒇡": 219,
  "𒇥": 220,
  "𒇧": 221,
  "𒇬": 222,
  "𒇭": 223,
  "𒇯": 224,
  "𒇲": 225,
  "𒇳": 226,
  "𒇴": 227,
  "𒇷": 228,
  "𒇸": 229,
  "𒇹": 230,
  "𒇺": 231,
  "𒇻": 232,
  "𒇽": 233,
  "𒇿": 234,
  "𒈖": 235,
  "𒈗": 236,
  "𒈛": 237,
  "𒈜": 238,
  "𒈝": 239,
  "𒈠": 240,
  "𒈢": 241,
  "𒈣": 242,
  "𒈤": 243,
  "𒈥": 244,
  "𒈦": 245,
  "𒈧": 246,
  "𒈨": 247,
  "𒈩": 248,
  "𒈪": 249,
  "𒈫": 250,
  "𒈬": 251,
  "𒈭": 252,
  "𒈮": 253,
  "𒈯": 254,
  "𒈲": 255,
  "𒈹": 256,
  "𒈻": 257,
  "𒈽": 258,
  "𒈾": 259,
  "𒈿": 260,
  "𒉀": 261,
  "𒉄": 262,
  "𒉅": 263,
  "𒉆": 264,
  "𒉇": 265,
  "𒉈": 266,
  "𒉋": 267,
  "𒉌": 268,
  "𒉎": 269,
  "𒉏": 270,
  "𒉐": 271,
  "𒉓": 272,
  "𒉘": 273,
  "𒉚": 274,
  "𒉠": 275,
  "𒉡": 276,
  "𒉢": 277,
  "𒉣": 278,
  "𒉪": 279,
  "𒉭": 280,
  "𒉺": 281,
  "𒉻": 282,
  "𒉼": 283,
  "𒉽": 284,
  "𒉾": 285,
  "𒉿": 286,
  "𒊊": 287,
  "𒊌": 288,
  "𒊍": 289,
  "𒊏": 290,
  "𒊐": 291,
  "𒊑": 292,
  "𒊒": 293,
  "𒊓": 294,
  "𒊕": 295,
  "𒊚": 296,
  "𒊨": 297,
  "𒊩": 298,
  "𒊬": 299,
  "𒊭": 300,
  "𒊮": 301,
  "𒊯": 302,
  "𒊷": 303,
  "𒊹": 304,
  "𒊺": 305,
  "𒊻": 306,
  "𒊿": 307,
  "𒋀": 308,
  "𒋁": 309,
  "𒋃": 310,
  "𒋆": 311,
  "𒋇": 312,
  "𒋋": 313,
  "𒋒": 314,
  "𒋓": 315,
  "𒋗": 316,
  "𒋙": 317,
  "𒋚": 318,
  "𒋛": 319,
  "𒋜": 320,
  "𒋝": 321,
  "𒋞": 322,
  "𒋠": 323,
  "𒋡": 324,
  "𒋢": 325,
  "𒋤": 326,
  "𒋥": 327,
  "𒋦": 328,
  "𒋧": 329,
  "𒋩": 330,
  "𒋫": 331,
  "𒋬": 332,
  "𒋭": 333,
  "𒋰": 334,
  "𒋳": 335,
  "𒋺": 336,
  "𒋻": 337,
  "𒋼": 338,
  "𒋽": 339,
  "𒋾": 340,
  "𒌀": 341,
  "𒌁": 342,
  "𒌅": 343,
  "𒌆": 344,
  "𒌇": 345,
  "𒌈": 346,
  "𒌉": 347,
  "𒌋": 348,
  "𒌌": 349,
  "𒌍": 350,
  "𒌑": 351,
  "𒌒": 352,
  "𒌓": 353,
  "𒌔": 354,
  "𒌗": 355,
  "𒌜": 356,
  "𒌝": 357,
  "𒌢": 358,
  "𒌣": 359,
  "𒌤": 360,
  "𒌦": 361,
  "𒌨": 362,
  "𒌫": 363,
  "𒌴": 364,
  "𒌵": 365,
  "𒌶": 366,
  "𒌷": 367,
  "𒌺": 368,
  "𒍀": 369,
  "𒍂": 370,
  "𒍇": 371,
  "𒍍": 372,
  "𒍎": 373,
  "𒍏": 374,
  "𒍑": 375,
  "𒍒": 376,
  "𒍗": 377,
  "𒍚": 378,
  "𒍜": 379,
  "𒍝": 380,
  "𒍠": 381,
  "𒍢": 382,
  "𒍣": 383,
  "𒍤": 384,
  "𒍥": 385,
  "𒍦": 386,
  "𒍨": 387,
  "𒍩": 388,
  "𒍪": 389,
  "𒍬": 390,
  "𒍮": 391,
  "𒐈": 392,
  "𒐉": 393,
  "𒐊": 394,
  "𒐋": 395,
  "𒐌": 396,
  "𒐍": 397,
  "𒐏": 398,
  "𒐐": 399,
  "𒐕": 400,
  "𒐖": 401,
  "𒐗": 402,
  "𒐘": 403,
  "𒐙": 404,
  "𒐜": 405,
  "𒐞": 406,
  "𒑆": 407,
  "𒑏": 408,
  "𒑐": 409,
  "𒑑": 410,
  "𒑒": 411,
  "𒑔": 412,
  "𒑖": 413,
  "𒑚": 414,
  "𒑛": 415,
  "𒑱": 416,
  "𒑳": 417
}