{
  "<pad>": 0,
  "<sos>": 1,
  "<eos>": 2,
  "<unk>": 3,
  "\n": 4,
  "(": 5,
  ")": 6,
  ".": 7,
  "0": 8,
  "1": 9,
  "5": 10,
  "D": 11,
  "E": 12,
  "N": 13,
  "a": 14,
  "b": 15,
  "n": 16,
  "o": 17,
  "₂": 18,
  "": 19,
  "𒀀": 20,
  "𒀉": 21,
  "𒀊": 22,
  "𒀏": 23,
  "𒀕": 24,
  "𒀖": 25,
  "𒀘": 26,
  "𒀚": 27,
  "𒀜": 28,
  "𒀝": 29,
  "𒀞": 30,
  "𒀠": 31,
  "𒀩": 32,
  "𒀪": 33,
  "𒀫": 34,
  "𒀬": 35,
  "𒀭": 36,
  "𒀮": 37,
  "𒀯": 38,
  "𒀲": 39,
  "𒀳": 40,
  "𒀴": 41,
  "𒀸": 42,
  "𒀹": 43,
  "𒀾": 44,
  "𒀿": 45,
  "𒁀": 46,
  "𒁁": 47,
  "𒁃": 48,
  "𒁄": 49,
  "𒁇": 50,
  "𒁈": 51,
  "𒁉": 52,
  "𒁍": 53,
  "𒁑": 54,
  "𒁓": 55,
  "𒁔": 56,
  "𒁕": 57,
  "𒁖": 58,
  "𒁜": 59,
  "𒁦": 60,
  "𒁮": 61,
  "𒁯": 62,
  "𒁰": 63,
  "𒁲": 64,
  "𒁳": 65,
  "𒁴": 66,
  "𒁵": 67,
  "𒁶": 68,
  "𒁷": 69,
  "𒁹": 70,
  "𒁺": 71,
  "𒁻": 72,
  "𒁼": 73,
  "𒁾": 74,
  "𒂀": 75,
  "𒂁": 76,
  "𒂂": 77,
  "𒂃": 78,
  "𒂄": 79,
  "𒂅": 80,
  "𒂆": 81,
  "𒂇": 82,
  "𒂈": 83,
  "𒂉": 84,
  "𒂊": 85,
  "𒂍": 86,
  "𒂔": 87,
  "𒂕": 88,
  "𒂖": 89,
  "𒂗": 90,
  "𒂙": 91,
  "𒂞": 92,
  "𒂟": 93,
  "𒂠": 94,
  "𒂡": 95,
  "𒂦": 96,
  "𒂵": 97,
  "𒂷": 98,
  "𒂼": 99,
  "𒃌": 100,
  "𒃞": 101,
  "𒃡": 102,
  "𒃢": 103,
  "𒃣": 104,
  "𒃮": 105,
  "𒃰": 106,
  "𒃲": 107,
  "𒃴": 108,
  "𒃵": 109,
  "𒃶": 110,
  "𒃷": 111,
  "𒃸": 112,
  "𒃻": 113,
  "𒃼": 114,
  "𒃽": 115,
  "𒃾": 116,
  "𒄀": 117,
  "𒄃": 118,
  "𒄄": 119,
  "𒄇": 120,
  "𒄈": 121,
  "𒄉": 122,
  "𒄊": 123,
  "𒄋": 124,
  "𒄑": 125,
  "𒄒": 126,
  "𒄖": 127,
  "𒄗": 128,
  "𒄘": 129,
  "𒄙": 130,
  "𒄛": 131,
  "𒄝": 132,
  "𒄞": 133,
  "𒄠": 134,
  "𒄢": 135,
  "𒄣": 136,
  "𒄤": 137,
  "𒄥": 138,
  "𒄧": 139,
  "𒄨": 140,
  "𒄩": 141,
  "𒄫": 142,
  "𒄬": 143,
  "𒄭": 144,
  "𒄯": 145,
  "𒄰": 146,
  "𒄴": 147,
  "𒄵": 148,
  "𒄷": 149,
  "𒄸": 150,
  "𒄽": 151,
  "𒄾": 152,
  "𒄿": 153,
  "𒅀": 154,
  "𒅁": 155,
  "𒅂": 156,
  "𒅅": 157,
  "𒅆": 158,
  "𒅇": 159,
  "𒅈": 160,
  "𒅊": 161,
  "𒅋": 162,
  "𒅍": 163,
  "𒅎": 164,
  "𒅓": 165,
  "𒅔": 166,
  "𒅕": 167,
  "𒅖": 168,
  "𒅗": 169,
  "𒅘": 170,
  "𒅜": 171,
  "𒅤": 172,
  "𒅥": 173,
  "𒅪": 174,
  "𒅴": 175,
  "𒅸": 176,
  "𒅻": 177,
  "𒅾": 178,
  "𒆃": 179,
  "𒆍": 180,
  "𒆏": 181,
  "𒆐": 182,
  "𒆑": 183,
  "𒆓": 184,
  "𒆕": 185,
  "𒆗": 186,
  "𒆘": 187,
  "𒆚": 188,
  "𒆛": 189,
  "𒆜": 190,
  "𒆟": 191,
  "𒆠": 192,
  "𒆤": 193,
  "𒆥": 194,
  "𒆦": 195,
  "𒆧": 196,
  "𒆪": 197,
  "𒆬": 198,
  "𒆭": 199,
  "𒆯": 200,
  "𒆰": 201,
  "𒆲": 202,
  "𒆳": 203,
  "𒆷": 204,
  "𒆸": 205,
  "𒆹": 206,
  "𒇀": 207,
  "𒇇": 208,
  "𒇉": 209,
  "𒇡": 210,
  "𒇥": 211,
  "𒇧": 212,
  "𒇬": 213,
  "𒇭": 214,
  "𒇯": 215,
  "𒇲": 216,
  "𒇳": 217,
  "𒇴": 218,
  "𒇷": 219,
  "𒇸": 220,
  "𒇹": 221,
  "𒇺": 222,
  "𒇻": 223,
  "𒇽": 224,
  "𒇿": 225,
  "𒈗": 226,
  "𒈛": 227,
  "𒈜": 228,
  "𒈝": 229,
  "𒈠": 230,
  "𒈢": 231,
  "𒈣": 232,
  "𒈤": 233,
  "𒈥": 234,
  "𒈦": 235,
  "𒈧": 236,
  "𒈨": 237,
  "𒈩": 238,
  "𒈪": 239,
  "𒈫": 240,
  "𒈬": 241,
  "𒈭": 242,
  "𒈮": 243,
  "𒈯": 244,
  "𒈲": 245,
  "𒈹": 246,
  "𒈻": 247,
  "𒈽": 248,
  "𒈾": 249,
  "𒈿": 250,
  "𒉀": 251,
  "𒉄": 252,
  "𒉅": 253,
  "𒉆": 254,
  "𒉈": 255,
  "𒉋": 256,
  "𒉌": 257,
  "𒉎": 258,
  "𒉏": 259,
  "𒉐": 260,
  "𒉓": 261,
  "𒉘": 262,
  "𒉚": 263,
  "𒉠": 264,
  "𒉡": 265,
  "𒉢": 266,
  "𒉣": 267,
  "𒉪": 268,
  "𒉭": 269,
  "𒉺": 270,
  "𒉻": 271,
  "𒉼": 272,
  "𒉽": 273,
  "𒉿": 274,
  "𒊊": 275,
  "𒊌": 276,
  "𒊍": 277,
  "𒊏": 278,
  "𒊐": 279,
  "𒊑": 280,
  "𒊒": 281,
  "𒊓": 282,
  "𒊕": 283,
  "𒊨": 284,
  "𒊩": 285,
  "𒊬": 286,
  "𒊭": 287,
  "𒊮": 288,
  "𒊯": 289,
  "𒊷": 290,
  "𒊹": 291,
  "𒊺": 292,
  "𒊻": 293,
  "𒊿": 294,
  "𒋀": 295,
  "𒋁": 296,
  "𒋃": 297,
  "𒋆": 298,
  "𒋇": 299,
  "𒋋": 300,
  "𒋒": 301,
  "𒋓": 302,
  "𒋗": 303,
  "𒋙": 304,
  "𒋚": 305,
  "𒋛": 306,
  "𒋜": 307,
  "𒋝": 308,
  "𒋞": 309,
  "𒋠": 310,
  "𒋡": 311,
  "𒋢": 312,
  "𒋤": 313,
  "𒋥": 314,
  "𒋦": 315,
  "𒋧": 316,
  "𒋩": 317,
  "𒋫": 318,
  "𒋬": 319,
  "𒋭": 320,
  "𒋰": 321,
  "𒋳": 322,
  "𒋺": 323,
  "𒋻": 324,
  "𒋼": 325,
  "𒋽": 326,
  "𒋾": 327,
  "𒌀": 328,
  "𒌁": 329,
  "𒌅": 330,
  "𒌆": 331,
  "𒌇": 332,
  "𒌈": 333,
  "𒌉": 334,
  "𒌋": 335,
  "𒌌": 336,
  "𒌍": 337,
  "𒌑": 338,
  "𒌒": 339,
  "𒌓": 340,
  "𒌔": 341,
  "𒌗": 342,
  "𒌜": 343,
  "𒌝": 344,
  "𒌢": 345,
  "𒌣": 346,
  "𒌤": 347,
  "𒌦": 348,
  "𒌨": 349,
  "𒌫": 350,
  "𒌴": 351,
  "𒌵": 352,
  "𒌶": 353,
  "𒌷": 354,
  "𒌺": 355,
  "𒍀": 356,
  "𒍂": 357,
  "𒍇": 358,
  "𒍍": 359,
  "𒍎": 360,
  "𒍏": 361,
  "𒍑": 362,
  "𒍒": 363,
  "𒍗": 364,
  "𒍚": 365,
  "𒍜": 366,
  "𒍝": 367,
  "𒍠": 368,
  "𒍢": 369,
  "𒍣": 370,
  "𒍤": 371,
  "𒍥": 372,
  "𒍦": 373,
  "𒍨": 374,
  "𒍩": 375,
  "𒍪": 376,
  "𒍮": 377,
  "𒐈": 378,
  "𒐉": 379,
  "𒐊": 380,
  "𒐋": 381,
  "𒐌": 382,
  "𒐍": 383,
  "𒐏": 384,
  "𒐐": 385,
  "𒐕": 386,
  "𒐖": 387,
  "𒐗": 388,
  "𒐘": 389,
  "𒐜": 390,
  "𒐞": 391,
  "𒑆": 392,
  "𒑏": 393,
  "𒑐": 394,
  "𒑑": 395,
  "𒑒": 396,
  "𒑔": 397,
  "𒑖": 398,
  "𒑚": 399,
  "𒑛": 400,
  "𒑱": 401,
  "𒑳": 402
}